uses graphabc;
begin;
circle(290,205,20); // голова кста
floodfill(290,205,clblack);
line (300,220,350,290);
line (330,300,370,280);
line (330,300,330,340);
line (370,280,410,290);

line (413,293,460,340);
line (460,340,480,325);//пятка
line (330,350,310,390);
line (310,390,320,395);//пятка

line (280,240,320,210);
line (280,240,250,250);
line (250,250,220,220);

SetPenColor(clblue);
line (200,230,270,190);
SetPenColor(clblack);
line (320,210,340,180);
line (340,180,370,160);

end.